In [15]:
# Correctly inputing the imports
import pandas as pd
import os
import matplotlib.pyplot as plt
import seaborn as sns

In [16]:
# Creating a variable to the correcty called df to access the data through pd.read_execl
df = pd.read_excel('C:/Users/Samuel Kim/Downloads/HospitalCosts.xlsx' )
print(df)

     AGE  FEMALE  LOS  RACE  TOTCHG  APRDRG
0     17       1    2   1.0    2660     560
1     17       0    2   1.0    1689     753
2     17       1    7   1.0   20060     930
3     17       1    1   1.0     736     758
4     17       1    1   1.0    1194     754
..   ...     ...  ...   ...     ...     ...
495    0       1    6   1.0    5881     636
496    0       1    2   1.0    1171     640
497    0       1    2   1.0    1171     640
498    0       1    2   1.0    1086     640
499    0       0    4   1.0    4931     640

[500 rows x 6 columns]

In [17]:
# We are checking to see the rows and columns 
df.shape

(500, 6)

In [18]:
# We are now taking a look at the first 5 data points 
df.head()

   AGE  FEMALE  LOS  RACE  TOTCHG  APRDRG
0   17       1    2   1.0    2660     560
1   17       0    2   1.0    1689     753
2   17       1    7   1.0   20060     930
3   17       1    1   1.0     736     758
4   17       1    1   1.0    1194     754

In [19]:
# Check the information on the data types and the overall data set
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 500 entries, 0 to 499
Data columns (total 6 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   AGE     500 non-null    int64
 1   FEMALE  500 non-null    int64
 2   LOS     500 non-null    int64
 3   RACE    499 non-null    float64
 4   TOTCHG  500 non-null    int64
 5   APRDRG  500 non-null    int64
dtypes: float64(1), int64(5)
memory usage: 23.6 KB

In [20]:
# As we can see in the previous data "RACE" seems to be a float and seems to have all same values of 1. Therefore this is not needed and we should delete it.
del df['RACE']

In [21]:
#Recheck to see if "RACE" was deleted.
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 500 entries, 0 to 499
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   AGE     500 non-null    int64
 1   FEMALE  500 non-null    int64
 2   LOS     500 non-null    int64
 3   TOTCHG  500 non-null    int64
 4   APRDRG  500 non-null    int64
dtypes: int64(5)
memory usage: 19.7 KB

In [22]:
#Lets take a look at each individual column categories and see the mean, median, standard deviation, and etc.
df.describe()[['AGE', 'FEMALE','LOS','TOTCHG','APRDRG']]

              AGE      FEMALE         LOS        TOTCHG      APRDRG
count  500.000000  500.000000  500.000000    500.000000  500.000000
mean     5.086000    0.512000    2.828000   2774.388000  616.360000
std      6.949474    0.500357    3.363487   3888.407367  178.316044
min      0.000000    0.000000    0.000000    532.000000   21.000000
25%      0.000000    0.000000    2.000000   1216.250000  640.000000
50%      0.000000    1.000000    2.000000   1536.500000  640.000000
75%     13.000000    1.000000    3.000000   2530.250000  751.000000
max     17.000000    1.000000   41.000000  48388.000000  952.000000

In [23]:
#We should add another column that represent total medical cost by TOTCHG (Total Charge)) divided by LOS (Length of Stay)
df['MEDCOST'] = df['TOTCHG'] / df['LOS']

In [24]:
#Lets take a look at our new column to see our data within total medical cost
df.head()

   AGE  FEMALE  LOS  TOTCHG  APRDRG      MEDCOST
0   17       1    2    2660     560  1330.000000
1   17       0    2    1689     753   844.500000
2   17       1    7   20060     930  2865.714286
3   17       1    1     736     758   736.000000
4   17       1    1    1194     754  1194.000000

In [25]:
#looking within our data set we can see if we need to drop NA
df = df.dropna()

In [26]:
#lets take a look at our new data set with dropping NA. It seems there was no NA
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 500 entries, 0 to 499
Data columns (total 6 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   AGE      500 non-null    int64
 1   FEMALE   500 non-null    int64
 2   LOS      500 non-null    int64
 3   TOTCHG   500 non-null    int64
 4   APRDRG   500 non-null    int64
 5   MEDCOST  500 non-null    float64
dtypes: float64(1), int64(5)
memory usage: 27.3 KB